In [1]:
===========eda================
1) pandas : data frame applications
2) numpy : numarical python all math applications
3) matplotlib: usedd for plotting 
4) seaborn : used for plot
5) ploly : used for plot
6) bohke :  plot
====================machine learining =================
7) sickit-learn: sklear
deep learning==================
8) tensorflow : goolge
9)keras : google
10) pytorch : facebook

SyntaxError: unmatched ')' (2015194539.py, line 2)

In [2]:
import pandas as pd
Names=["praveen","anil","vijay","ravi"]

In [3]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
import pandas as pd
Names=["praveen","anil","vijay","ravi"]
pd.DataFrame(Names)

         0
0  praveen
1     anil
2    vijay
3     ravi

In [5]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
pd.DataFrame(zip(Names,age))

         0   1
0  praveen  25
1     anil  30
2    vijay  40
3     ravi  50

In [6]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
pd.DataFrame(zip(Names,age,city))

         0   1        2
0  praveen  25      hyd
1     anil  30   mumbai
2    vijay  40  chennai
3     ravi  50    delhi

In [7]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
Data=(zip(Names,age))
pd.DataFrame(Data,city)

               0   1
hyd      praveen  25
mumbai      anil  30
chennai    vijay  40
delhi       ravi  50

In [8]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
Data=(zip(Names,city))
pd.DataFrame(Data,age)

          0        1
25  praveen      hyd
30     anil   mumbai
40    vijay  chennai
50     ravi    delhi

In [9]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
pd.DataFrame(zip(Names,age,city),
             columns=["Names","age","city"])

     Names age     city
0  praveen  25      hyd
1     anil  30   mumbai
2    vijay  40  chennai
3     ravi  50    delhi

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
pd.DataFrame(zip(Names,age,city),columns=["Names","age","city"])

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
Data=(zip(age,city))
pd.DataFrame(Data,Names)

In [3]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
pd.DataFrame(zip(Names,age,city),
             columns=["Names","age","city"])

NameError: name 'pd' is not defined

In [10]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
Data=zip(Names,age,city)
cols=["Name","age","city"]
df=pd.DataFrame(Data,columns=cols)

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:

print("the columns are:",df.shape[1])
print("the rows are:",df.shape[0])

the columns are: 3
the rows are: 4

In [13]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
Data=zip(Names,age,city)
cols=["Names","age","city"]
df=pd.DataFrame(Data,columns=cols)
df

     Names age     city
0  praveen  25      hyd
1     anil  30   mumbai
2    vijay  40  chennai
3     ravi  50    delhi

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
df=pd.DataFrame(Data,columns=cols)
df

In [ ]:
import pandas as pd

In [ ]:
df['names']=["Ravi","manoj","praveen","rohit"]
df

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
IDX=["A","B","C","D"]
df=pd.DataFrame(Data,columns=cols,index=IDX)
df

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
idx=["A","b","c","d"]
df=pd.DataFrame(Data,columns=cols,index=idx)
df

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
inx=["1","2","3","4"]
df=pd.DataFrame(Data,columns=cols,index=inx)
df

**shap method**

In [ ]:
df.shape
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

In [ ]:
df.shape
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

In [ ]:
df.shape
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

In [ ]:
df.shape
print("the rows are:",df.shape[0])
print("the columns are:",df.shape[1])

In [ ]:
df.drop("age",axis=1,inplace=True)

In [ ]:
df

In [ ]:
df.drop("city",axis=1,inplace=True)

In [ ]:
df

In [ ]:
df.drop("Names",axis=1,inplace=True)

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
inx=["1","2","3","4"]
cols=["Names","age","city","No"]
df=pd.DataFrame(Data,index=inx,columns=cols)
df

In [ ]:
df.drop("1",axis=0,inplace=True)

In [ ]:
df

In [ ]:
df.drop("city",axis=1,inplace=True)

In [ ]:
df

In [ ]:
df

In [ ]:
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
inx=["1","2","3","4"]
df=pd.DataFrame(Data,columns=cols,index=inx)
df

In [ ]:
df.to_csv("data.csv",index=False)

In [ ]:
import pandas as pd
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
inx=["1","2","3","4"]
df=pd.DataFrame(Data,columns=cols,index=inx)
df

In [ ]:
import pandas as pd
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
inx=["1","2","3","4"]
df=pd.DataFrame(Data,columns=cols,index=inx)
dfimport pandas as pd
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
inx=["1","2","3","4"]
df=pd.DataFrame(Data,columns=cols,index=inx)
df

In [ ]:
import pandas as pd
Names=["praveen","anil","vijay","ravi"]
age=["25","30","40","50"]
city=["hyd","mumbai","chennai","delhi"]
NO=["1","2","3","4"]
Data=zip(Names,age,city,NO)
cols=["Names","age","city","NO"]
inx=["1","2","3","4"]
df=pd.DataFrame(Data,columns=cols,index=inx)
df

In [ ]:
df.to_excel("data2.xlsx",index=True)

In [ ]:
import pandas as pd
names=["vijay","aravind","sai","lokesh","sidhu"]
age=["20","25","30","28","35"]
city=["hyd","mumbai","chennai","dlehi","bhopall"]
country=["india","india","india","india","india"]
Data=zip(names,age,city,country)
cols=["names","age","city","country"]
inx=[1,2,3,4,5]
df=pd.DataFrame(Data,index=inx,columns=cols)

df

In [ ]:
df.drop(1,axis=0)

In [ ]:
df.to_csv("data.csv")

In [ ]:
df.to_csv('datae.csv',index=False)

In [ ]:
df.to_excel("data2.xlsx",index=False)

In [ ]:
import pandas as pd

In [ ]:
pd.read_csv("data1.csv")

In [2]:
import pandas as pd

In [11]:
names=["praveen","aravind","vinay",]
age=[20,22,23]
Data=zip(names,age)
cols=["names","age"]
idx=['a','b','c']
df=pd.DataFrame(Data,columns=cols,index=idx)
df

     names  age
a  praveen   20
b  aravind   22
c    vinay   23

In [7]:
job=["DS","TS","VS"]
df["job"]=job
df                   # add new columns in eda session

     names  age job
0  praveen   20  DS
1  aravind   22  TS
2    vinay   23  VS

In [8]:
df["age"]=[30,35,40]
df

     names  age job
0  praveen   30  DS
1  aravind   35  TS
2    vinay   40  VS

In [12]:
df.shape
print("the number of rows are",df.shape[0])
print("The number of columns are",df.shape[1])

the number of rows are 3
The number of columns are 2

In [13]:
df

     names  age
a  praveen   20
b  aravind   22
c    vinay   23

In [16]:
df.drop("age",axis=1,inplace=True)
df

     names
a  praveen
b  aravind
c    vinay

In [17]:
df.drop("names",axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: [a, b, c]

In [18]:
df

Empty DataFrame
Columns: []
Index: [a, b, c]

In [20]:
Names=["praveen","aravind","pooja","dar"]
age=[20,30,50,25]
city=["mumbai","chennai","bengoler","delhi"]
data=zip(Names,age,city)
cols=["Names","age","city"]
idx=[1,2,3,4]
df=pd.DataFrame(data,columns=cols,index=idx)
df

     Names  age      city
1  praveen   20    mumbai
2  aravind   30   chennai
3    pooja   50  bengoler
4      dar   25     delhi

In [24]:
df.drop(1,axis=0,inplace=True)
df

     Names  age      city
2  aravind   30   chennai
3    pooja   50  bengoler
4      dar   25     delhi

In [25]:
df.to_csv("Data.csv")
df.to_csv("data1.csv",index=False)

In [26]:
pd.read_csv("data1.csv")

     Names  age      city
0  aravind   30   chennai
1    pooja   50  bengoler
2      dar   25     delhi

In [28]:
dict1={"Names":["avinash","praveen","naveen"],"age":[20,25,30]}
dict1

{'Names': ['avinash', 'praveen', 'naveen'], 'age': [20, 25, 30]}

In [29]:
pd.DataFrame(dict1)

     Names  age
0  avinash   20
1  praveen   25
2   naveen   30

In [30]:
dict1={"Names":["avinash","praveen","naveen"],"age":[20,25,30]}
dict1

{'Names': ['avinash', 'praveen', 'naveen'], 'age': [20, 25, 30]}

In [33]:
pd.DataFrame(dict1,index=[1,2,3])

     Names  age
1  avinash   20
2  praveen   25
3   naveen   30

In [14]:
import pandas as pd

In [1]:
dict2={"Names":["praveen","ajay","vijay","arun"],"age":[30,20,25]}
dict2

{'Names': ['praveen', 'ajay', 'vijay', 'arun'], 'age': [30, 20, 25]}

In [15]:
pd.DataFrame(dict2)

NameError: name 'dict2' is not defined

In [16]:
dict2={'Names':'Avinash',
'Ages':25,
'City':'Hyd'}
pd.DataFrame(dict2,index=[1,2,3])

     Names  Ages City
1  Avinash    25  Hyd
2  Avinash    25  Hyd
3  Avinash    25  Hyd

In [19]:
dict3={"Names":["praveen","vinay","raju"],"age":[30,20,25]}
pd.DataFrame(dict3)

     Names  age
0  praveen   30
1    vinay   20
2     raju   25

In [20]:
import pandas as pd

In [23]:
visa_df=pd.read_csv(r"C:\Users\Admin\Documents\EDA\Visadataset - Visadataset (1).csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [24]:
visa_df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [25]:
visa_df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [28]:
visa_df.shape

(25480, 12)

In [30]:
print(f"the number of rows {visa_df.shape[0]}")
print(f"the number of columns{visa_df.shape[1]}")

the number of rows 25480
the number of columns12

In [32]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB